Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.39/edc/PIC32MZ0512EFK064.PIC
      <edc:SFRDef edc:_addr="0x1F800C20" edc:_begin="0x0" edc:_end="0x60" edc:_modsrc="DOS-01261_tmr_rtcc_pb_v2.Module" edc:_refcount="1" edc:access="rrrnnnnnnnnnnnnnrnnnnnnn--------" edc:cname="RTCTIME" edc:desc="" edc:grp="RTCC" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000xxxxxxxxxxxxx0xxxxxxx--------" edc:name="RTCTIME" edc:nzwidth="0x20" edc:por="000xxxxxxxxxxxxx0xxxxxxx--------" edc:portals="CLR SET INV" ltx:memberofperipheral="RTCC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="8"/>
            <edc:SFRFieldDef edc:cname="SEC01" edc:desc="" edc:mask="0xf" edc:name="SEC01" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="SEC10" edc:desc="" edc:mask="0xf" edc:name="SEC10" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="MIN01" edc:desc="" edc:mask="0xf" edc:name="MIN01" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="MIN10" edc:desc="" edc:mask="0xf" edc:name="MIN10" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="HR01" edc:desc="" edc:mask="0xf" edc:name="HR01" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="HR10" edc:desc="" edc:mask="0xf" edc:name="HR10" edc:nzwidth="0x4"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800C30" edc:_begin="0x0" edc:_end="0x60" edc:_modsrc="DOS-01261_tmr_rtcc_pb_v2.Module" edc:_refcount="1" edc:access="nnnnnnnnrrrnnnnnrrnnnnnn----rnnn" edc:cname="RTCDATE" edc:desc="" edc:grp="RTCC" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx000xxxxx00xxxxxx----0xxx" edc:name="RTCDATE" edc:nzwidth="0x20" edc:por="xxxxxxxx000xxxxx00xxxxxx----0xxx" edc:portals="CLR SET INV" ltx:memberofperipheral="RTCC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="WDAY01" edc:desc="" edc:mask="0xf" edc:name="WDAY01" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="DAY01" edc:desc="" edc:mask="0xf" edc:name="DAY01" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="DAY10" edc:desc="" edc:mask="0xf" edc:name="DAY10" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="MONTH01" edc:desc="" edc:mask="0xf" edc:name="MONTH01" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="MONTH10" edc:desc="" edc:mask="0xf" edc:name="MONTH10" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="YEAR01" edc:desc="" edc:mask="0xf" edc:name="YEAR01" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="YEAR10" edc:desc="" edc:mask="0xf" edc:name="YEAR10" edc:nzwidth="0x4"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800C40" edc:_begin="0x0" edc:_end="0x60" edc:_modsrc="DOS-01261_tmr_rtcc_pb_v2.Module" edc:_refcount="1" edc:access="rrrnnnnnrnnnnnnnrnnnnnnn--------" edc:cname="ALRMTIME" edc:desc="" edc:grp="RTCC" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000xxxxx0xxxxxxx0xxxxxxx--------" edc:name="ALRMTIME" edc:nzwidth="0x20" edc:por="000xxxxx0xxxxxxx0xxxxxxx--------" edc:portals="CLR SET INV" ltx:memberofperipheral="RTCC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="8"/>
            <edc:SFRFieldDef edc:cname="SEC01" edc:desc="" edc:mask="0xf" edc:name="SEC01" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="SEC10" edc:desc="" edc:mask="0xf" edc:name="SEC10" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="MIN01" edc:desc="" edc:mask="0xf" edc:name="MIN01" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="MIN10" edc:desc="" edc:mask="0xf" edc:name="MIN10" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="HR01" edc:desc="" edc:mask="0xf" edc:name="HR01" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="HR10" edc:desc="" edc:mask="0xf" edc:name="HR10" edc:nzwidth="0x4"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800C50" edc:_begin="0x0" edc:_end="0x60" edc:_modsrc="DOS-01261_tmr_rtcc_pb_v2.Module" edc:_refcount="1" edc:access="--------rrrnnnnnrrnnnnnn----rnnn" edc:cname="ALRMDATE" edc:desc="" edc:grp="RTCC" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------000xxxxx00xxxxxx----0xxx" edc:name="ALRMDATE" edc:nzwidth="0x20" edc:por="--------000xxxxx00xxxxxx----0xxx" edc:portals="CLR SET INV" ltx:memberofperipheral="RTCC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="WDAY01" edc:desc="" edc:mask="0xf" edc:name="WDAY01" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="DAY01" edc:desc="" edc:mask="0xf" edc:name="DAY01" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="DAY10" edc:desc="" edc:mask="0xf" edc:name="DAY10" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="MONTH01" edc:desc="" edc:mask="0xf" edc:name="MONTH01" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="MONTH10" edc:desc="" edc:mask="0xf" edc:name="MONTH10" edc:nzwidth="0x4"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F800C60" edc:offset="0x1a0"/>
      <edc:SFRDef edc:_addr="0x1F800E00" edc:_begin="0x0" edc:_end="0x10" edc:_modsrc="DOS-00800_dac_4bit_ctrl_pb_v1.Module" edc:_refcount="1" edc:access="----------------n--------nnnnnnn" edc:cname="CVRCON" edc:desc="" edc:grp="DAC4" edc:impl="0xfffff8ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000000000000000000000---00000000" edc:name="CVRCON" edc:nzwidth="0x20" edc:por="000000000000000000000---00000000" edc:portals="CLR SET INV" ltx:baseofperipheral="CVR">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CVR" edc:desc="" edc:mask="0xf" edc:name="CVR" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="CVRSS" edc:desc="" edc:mask="0x1" edc:name="CVRSS" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CVRR" edc:desc="" edc:mask="0x1" edc:name="CVRR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CVROE" edc:desc="" edc:mask="0x1" edc:name="CVROE" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="CVR0" edc:desc="" edc:mask="0x1" edc:name="CVR0" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CVR1" edc:desc="" edc:mask="0x1" edc:name="CVR1" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CVR2" edc:desc="" edc:mask="0x1" edc:name="CVR2" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CVR3" edc:desc="" edc:mask="0x1" edc:name="CVR3" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.1">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F800E10" edc:offset="0x320"/>
      <edc:SFRDef edc:_addr="0x1F801130" edc:_begin="0x130" edc:_end="0x150" edc:_modsrc="DOS-01539_icd_jtag_pb_v2.Module" edc:_refcount="1" edc:access="-----------------n-------nnnnnnn" edc:cname="_ICDCON" edc:desc="" edc:impl="0x407f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------------0-------0000000" edc:name="_ICDCON" edc:nzwidth="32" edc:por="-----------------0-------0000000" edc:portals="- - -">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CKSWBKEN" edc:desc="" edc:mask="0x1" edc:name="CKSWBKEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SLPBKEN" edc:desc="" edc:mask="0x1" edc:name="SLPBKEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="WDTBKEN" edc:desc="" edc:mask="0x1" edc:name="WDTBKEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="WDTEN" edc:desc="" edc:mask="0x1" edc:name="WDTEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RSTBUG" edc:desc="" edc:mask="0x1" edc:name="RSTBUG" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMTBKEN" edc:desc="" edc:mask="0x1" edc:name="DMTBKEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMTEN" edc:desc="" edc:mask="0x1" edc:name="DMTEN" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="7"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:desc="" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801140" edc:_begin="0x130" edc:_end="0x150" edc:_modsrc="DOS-01539_icd_jtag_pb_v2.Module" edc:_refcount="1" edc:access="----------------------------nnnn" edc:cname="_ICDSTAT" edc:desc="" edc:grp="_DDPSTAT" edc:impl="0xf9ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="_ICDSTAT" edc:nzwidth="0x20" edc:por="----------------------------0000" edc:portals="- - -" ltx:baseofperipheral="_DDPSTAT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CKSWBF" edc:desc="" edc:mask="0x1" edc:name="CKSWBF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SLPBF" edc:desc="" edc:mask="0x1" edc:name="SLPBF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WDTBF" edc:desc="" edc:mask="0x1" edc:name="WDTBF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMTBF" edc:desc="" edc:mask="0x1" edc:name="DMTBF" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:AdjustPoint edc:offset="16"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
