Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.39/edc/PIC32MZ0512EFK064.PIC
      <edc:SFRDef edc:_addr="0x1F84B04C" edc:_begin="0x38" edc:_end="0x40" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1.Module" edc:_refcount="4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADCCMP3" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="ADCCMP3" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DCMPLO" edc:mask="0xffff" edc:name="DCMPLO" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="DCMPHI" edc:mask="0xffff" edc:name="DCMPHI" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F84B050" edc:_begin="0x38" edc:_end="0x40" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1.Module" edc:_refcount="5" edc:access="-------------nnnnnnnnnnnnnnnnnnn" edc:cname="ADCCMPEN4" edc:desc="" edc:impl="0x7ffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------0000000000000000000" edc:name="ADCCMPEN4" edc:nzwidth="32" edc:por="-------------0000000000000000000" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CMPE0" edc:mask="0x1" edc:name="CMPE0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE1" edc:mask="0x1" edc:name="CMPE1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE2" edc:mask="0x1" edc:name="CMPE2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE3" edc:mask="0x1" edc:name="CMPE3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE4" edc:mask="0x1" edc:name="CMPE4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE5" edc:mask="0x1" edc:name="CMPE5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE6" edc:mask="0x1" edc:name="CMPE6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE7" edc:mask="0x1" edc:name="CMPE7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE8" edc:mask="0x1" edc:name="CMPE8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE9" edc:mask="0x1" edc:name="CMPE9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE10" edc:mask="0x1" edc:name="CMPE10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE11" edc:mask="0x1" edc:name="CMPE11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE12" edc:mask="0x1" edc:name="CMPE12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE13" edc:mask="0x1" edc:name="CMPE13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE14" edc:mask="0x1" edc:name="CMPE14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE15" edc:mask="0x1" edc:name="CMPE15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE16" edc:mask="0x1" edc:name="CMPE16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE17" edc:mask="0x1" edc:name="CMPE17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE18" edc:mask="0x1" edc:name="CMPE18" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F84B054" edc:_begin="0x38" edc:_end="0x40" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADCCMP4" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="ADCCMP4" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DCMPLO" edc:mask="0xffff" edc:name="DCMPLO" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="DCMPHI" edc:mask="0xffff" edc:name="DCMPHI" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F84B058" edc:_begin="0x38" edc:_end="0x40" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1.Module" edc:_refcount="6" edc:access="-------------nnnnnnnnnnnnnnnnnnn" edc:cname="ADCCMPEN5" edc:desc="" edc:impl="0x7ffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------0000000000000000000" edc:name="ADCCMPEN5" edc:nzwidth="32" edc:por="-------------0000000000000000000" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CMPE0" edc:mask="0x1" edc:name="CMPE0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE1" edc:mask="0x1" edc:name="CMPE1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE2" edc:mask="0x1" edc:name="CMPE2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE3" edc:mask="0x1" edc:name="CMPE3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE4" edc:mask="0x1" edc:name="CMPE4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE5" edc:mask="0x1" edc:name="CMPE5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE6" edc:mask="0x1" edc:name="CMPE6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE7" edc:mask="0x1" edc:name="CMPE7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE8" edc:mask="0x1" edc:name="CMPE8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE9" edc:mask="0x1" edc:name="CMPE9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE10" edc:mask="0x1" edc:name="CMPE10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE11" edc:mask="0x1" edc:name="CMPE11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE12" edc:mask="0x1" edc:name="CMPE12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE13" edc:mask="0x1" edc:name="CMPE13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE14" edc:mask="0x1" edc:name="CMPE14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE15" edc:mask="0x1" edc:name="CMPE15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE16" edc:mask="0x1" edc:name="CMPE16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE17" edc:mask="0x1" edc:name="CMPE17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE18" edc:mask="0x1" edc:name="CMPE18" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F84B05C" edc:_begin="0x38" edc:_end="0x40" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1.Module" edc:_refcount="6" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADCCMP5" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="ADCCMP5" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DCMPLO" edc:mask="0xffff" edc:name="DCMPLO" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="DCMPHI" edc:mask="0xffff" edc:name="DCMPHI" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F84B060" edc:_begin="0x38" edc:_end="0x40" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1.Module" edc:_refcount="7" edc:access="-------------nnnnnnnnnnnnnnnnnnn" edc:cname="ADCCMPEN6" edc:desc="" edc:impl="0x7ffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------0000000000000000000" edc:name="ADCCMPEN6" edc:nzwidth="32" edc:por="-------------0000000000000000000" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CMPE0" edc:mask="0x1" edc:name="CMPE0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE1" edc:mask="0x1" edc:name="CMPE1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE2" edc:mask="0x1" edc:name="CMPE2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE3" edc:mask="0x1" edc:name="CMPE3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE4" edc:mask="0x1" edc:name="CMPE4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE5" edc:mask="0x1" edc:name="CMPE5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE6" edc:mask="0x1" edc:name="CMPE6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE7" edc:mask="0x1" edc:name="CMPE7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE8" edc:mask="0x1" edc:name="CMPE8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE9" edc:mask="0x1" edc:name="CMPE9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE10" edc:mask="0x1" edc:name="CMPE10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE11" edc:mask="0x1" edc:name="CMPE11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE12" edc:mask="0x1" edc:name="CMPE12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE13" edc:mask="0x1" edc:name="CMPE13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE14" edc:mask="0x1" edc:name="CMPE14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE15" edc:mask="0x1" edc:name="CMPE15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE16" edc:mask="0x1" edc:name="CMPE16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE17" edc:mask="0x1" edc:name="CMPE17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE18" edc:mask="0x1" edc:name="CMPE18" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F84B064" edc:_begin="0x38" edc:_end="0x40" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1.Module" edc:_refcount="7" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADCCMP6" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="ADCCMP6" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DCMPLO" edc:mask="0xffff" edc:name="DCMPLO" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="DCMPHI" edc:mask="0xffff" edc:name="DCMPHI" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F84B068" edc:_begin="0x40" edc:_end="0x44" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1.Module" edc:_refcount="8" edc:access="nnnnnnnr---nnnnnrrrrrrrrrrrrrrrr" edc:cname="ADCFLTR1" edc:desc="" edc:impl="0xff1fffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000---000000000000000000000" edc:name="ADCFLTR1" edc:nzwidth="32" edc:por="00000000---000000000000000000000" ltx:memberofperipheral="ADCHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="FLTRDATA" edc:mask="0xffff" edc:name="FLTRDATA" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="CHNLID" edc:mask="0x1f" edc:name="CHNLID" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="AFRDY" edc:mask="0x1" edc:name="AFRDY" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AFGIEN" edc:mask="0x1" edc:name="AFGIEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRSAM" edc:mask="0x7" edc:name="OVRSAM" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="DFMODE" edc:mask="0x1" edc:name="DFMODE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATA16EN" edc:mask="0x1" edc:name="DATA16EN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AFEN" edc:mask="0x1" edc:name="AFEN" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F84B06C" edc:_begin="0x40" edc:_end="0x44" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1.Module" edc:_refcount="9" edc:access="nnnnnnnr---nnnnnrrrrrrrrrrrrrrrr" edc:cname="ADCFLTR2" edc:desc="" edc:impl="0xff1fffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000---000000000000000000000" edc:name="ADCFLTR2" edc:nzwidth="32" edc:por="00000000---000000000000000000000" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="FLTRDATA" edc:mask="0xffff" edc:name="FLTRDATA" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="CHNLID" edc:mask="0x1f" edc:name="CHNLID" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="AFRDY" edc:mask="0x1" edc:name="AFRDY" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AFGIEN" edc:mask="0x1" edc:name="AFGIEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRSAM" edc:mask="0x7" edc:name="OVRSAM" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="DFMODE" edc:mask="0x1" edc:name="DFMODE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATA16EN" edc:mask="0x1" edc:name="DATA16EN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AFEN" edc:mask="0x1" edc:name="AFEN" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
