Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.39/edc/PIC32MZ0512EFK064.PIC
      <edc:SFRDef edc:_addr="0x1F860470" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="4" edc:access="----------------n---n-----------" edc:cname="CNCONE" edc:desc="" edc:grp="PORTE" edc:impl="0xffff9fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0---0-----------" edc:name="CNCONE" edc:nzwidth="0x20" edc:por="----------------0---0-----------" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTE">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0xb"/>
            <edc:SFRFieldDef edc:cname="EDGEDETECT" edc:mask="0x1" edc:name="EDGEDETECT" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="CHANGE NOTICE E" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860480" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="4" edc:access="------------------------nnnnnnnn" edc:cname="CNENE" edc:desc="" edc:grp="PORTE" edc:impl="0xffc000ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------00000000" edc:name="CNENE" edc:nzwidth="0x20" edc:por="------------------------00000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTE">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNIEE0" edc:desc="" edc:mask="0x1" edc:name="CNIEE0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEE1" edc:desc="" edc:mask="0x1" edc:name="CNIEE1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEE2" edc:desc="" edc:mask="0x1" edc:name="CNIEE2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEE3" edc:desc="" edc:mask="0x1" edc:name="CNIEE3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEE4" edc:desc="" edc:mask="0x1" edc:name="CNIEE4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEE5" edc:desc="" edc:mask="0x1" edc:name="CNIEE5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEE6" edc:desc="" edc:mask="0x1" edc:name="CNIEE6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEE7" edc:desc="" edc:mask="0x1" edc:name="CNIEE7" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860490" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="4" edc:access="------------------------nnnnnnnn" edc:cname="CNSTATE" edc:desc="" edc:grp="PORTE" edc:impl="0xffff00ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------00000000" edc:name="CNSTATE" edc:nzwidth="0x20" edc:por="------------------------00000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTE">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNSTATE0" edc:desc="" edc:mask="0x1" edc:name="CNSTATE0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATE1" edc:desc="" edc:mask="0x1" edc:name="CNSTATE1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATE2" edc:desc="" edc:mask="0x1" edc:name="CNSTATE2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATE3" edc:desc="" edc:mask="0x1" edc:name="CNSTATE3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATE4" edc:desc="" edc:mask="0x1" edc:name="CNSTATE4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATE5" edc:desc="" edc:mask="0x1" edc:name="CNSTATE5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATE6" edc:desc="" edc:mask="0x1" edc:name="CNSTATE6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATE7" edc:desc="" edc:mask="0x1" edc:name="CNSTATE7" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8604A0" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="4" edc:access="------------------------nnnnnnnn" edc:cname="CNNEE" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------00000000" edc:name="CNNEE" edc:nzwidth="32" edc:por="------------------------00000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTE">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNNEE0" edc:mask="0x1" edc:name="CNNEE0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEE1" edc:mask="0x1" edc:name="CNNEE1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEE2" edc:mask="0x1" edc:name="CNNEE2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEE3" edc:mask="0x1" edc:name="CNNEE3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEE4" edc:mask="0x1" edc:name="CNNEE4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEE5" edc:mask="0x1" edc:name="CNNEE5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEE6" edc:mask="0x1" edc:name="CNNEE6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEE7" edc:mask="0x1" edc:name="CNNEE7" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8604B0" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="4" edc:access="------------------------nnnnnnnn" edc:cname="CNFE" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------00000000" edc:name="CNFE" edc:nzwidth="32" edc:por="------------------------00000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTE">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNFE0" edc:mask="0x1" edc:name="CNFE0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFE1" edc:mask="0x1" edc:name="CNFE1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFE2" edc:mask="0x1" edc:name="CNFE2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFE3" edc:mask="0x1" edc:name="CNFE3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFE4" edc:mask="0x1" edc:name="CNFE4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFE5" edc:mask="0x1" edc:name="CNFE5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFE6" edc:mask="0x1" edc:name="CNFE6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFE7" edc:mask="0x1" edc:name="CNFE7" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
